# У списков есть отрицательный индекс
# Списки == изменямый тип данных
# В списке может быть разные типы данных
# Списки может хранить списки
# Список можно создавать так => list()
# Передав в аргументы list() перебираемый объект можно сформировать список. list("str") -> ["s", "t", "r"].
# len() - длина списка, max() - макс значение в списке, min() - минимальное значение в списке
# sum() - сумму элементов в списке, sorted() - для сортировки по возрастанию, возвращает новый список
# sorted() - аргумент reverse=boolean, для сортировки по убыванию
# max(), min(), sorted() -> применимы к тем данным которые могут сравниваться.
# sort() - метод, изменяет список возвращает None
# операторы: +, *, in, del
# оператор + объединяет два списка в один
# оператор * элементые списка дублируется внтури, целое число
# оператор in проверка вхождения элемента в списке
# оператор del удаление элемента списка
