# методы списков
# append() - добавляеть элемент в конец списка, меняет список
# insert() - вставляет элемент на следующий индекс -> первый arg, второй arg - значение
# remove() - удаляет по значению
# pop() - удаляет и возвращает удаленный элемент, без аргумента удаляет последний. С арг то по индексу
# clear() - очищает список
# copy() - копирует значение другого списка
# count() - количество элементов с переданным значением
# index() - получаем индекс элемента переданного аргумента, второй аргумент - старт поиска
# reverse() - меняет порядок списка, инвертирует список
# sort() - сортирует список, возвращает None, при арг reverse=True сортирует список по убыванию
# 
