# переменная -> ссылка на объект в памяти.
# "=" -> оператор присваивание
# Если нету ссылок на объект в памяти он уничтожается сборщиком мусора.
# Тип переменной опредлеяется при присваиваний -> динамическая типизация
# Когда два переменных ссылается на один и тот же объект оно не копируется, а копируется лишь ссылка.
# Переменные не хранят значения а лишь ссылается на тот или иной объект
# Каскадное присваивание -> a = b = c = 0
# id(x) -> функция возращает идентификатор объекта на который ссылается указанная переменная
# Множественное присваивание -> a, b = 1, 2
# type(x) -> функция возвращает какой тип данных соддержит ссылка на объект
# Название регистрозависимые, 1 символ должен быть a-z, A-Z и символ подчериквание _
# Нельзя называть ключевые встроенные слова. Их можно получить в shell -> help() -> keywords
# Можно называть переменные встроенными функциями, но это -> pogchamp 3head.

# int
b = 1
# sty
c = 'a'
# float
d = 1.1
# list
e = []
# dict
f = {}
# tuple
g = ()
# boolean
h = True
